::Const.FactionArchetypes.extend([
	[
		{
			Traits = [
				this.Const.FactionTrait.NobleHouse,
				this.Const.FactionTrait.Warmonger,
				this.Const.FactionTrait.Tyrant
			],
                        Description = "Благородный дом %noblehousename% — гордая и неумолимая семья с длинной и кровавой историей завоеваний. Осев в своей крепости %factionfortressname%, они силой берут то, что считают своим по праву. Родовая вражда с домом %othernoblehouse% даёт бесконечные поводы и ненависть в сердцах поддерживать, и плавильни держать горячими.",
                        Mottos = [
                                "Он стоит на собственной силе",
                                "Побеждает тот, кто терпит",
                                "Смело и по праву",
                                "Под этим знаменем ты победишь",
                                "Не умирает тот, чья слава живёт",
                                "Ни шагу назад",
                                "Сквозь стрелы и врагов",
                                "Ничто не устоит перед доблестью и клинками",
                                "Таков путь к бессмертию",
                                "И мы тоже бросали копья",
                                "Цапля ищет высоты"
                        ]
                },
                {
                        Traits = [
                                this.Const.FactionTrait.NobleHouse,
                                this.Const.FactionTrait.Warmonger,
                                this.Const.FactionTrait.Marauder
                        ],
                        Description = "Презираемый за жестокость, зверство и жадность, дом %noblehousename% почти не общается с другими родами. Их капитаны и солдаты из крепости %factionfortressname% известны набегами на торговые караваны, дальние фермы и малые поселения. Жизнь здесь мало чего стоит, и многие наёмники, желавшие лёгкой монеты, находили у %noblehousename% лишь быструю смерть.",
                        Mottos = [
                                "Всё, что растёт, погибает в пепле",
                                "Мы растаптываем это ногами",
                                "За себя и за своих",
                                "Орел мух не ловит",
                                "Дела, а не слова",
                                "Боги кормят воронов",
                                "Всегда жаждущие",
                                "Сыны псов, идите сюда за мясом",
                                "Без добычи не уйдём"
                        ]
                },
                {
			Traits = [
				this.Const.FactionTrait.NobleHouse,
				this.Const.FactionTrait.Collector,
				this.Const.FactionTrait.Warmonger
			],
                        Description = "Дом %noblehousename% всегда смотрит к горизонту. Они бесконечно гонятся за богатствами чужих земель и готовы брать их силой. Из %factionfortressname% отправляются походы, чтобы присвоить мир, который, как они верят, по праву принадлежит им.",
                        Mottos = [
                                "Забирай",
                                "Азарт охоты",
                                "Бесконечная охота",
                                "Горизонт зовёт",
                                "Найди и владей",
                                "Всё, что мы видим, — наше",
                                "Охоте нет конца",
                                "Забрать всё",
                                "Всё принадлежит нам"
                        ]
                },
                {
			Traits = [
				this.Const.FactionTrait.NobleHouse,
				this.Const.FactionTrait.ManOfThePeople,
				this.Const.FactionTrait.Tyrant
			],
                        Description = "Благородный дом %noblehousename% — гордая и неумолимая семья с долгой и кровавой историей полного контроля. Обосновавшись в крепости %factionfortressname%, они принимают дань, считаемую их правом по крови. Хотя их правление жестоко, люди почитают их за стойкость.",
                        Mottos = [
                                "Люби своих вышестоящих",
                                "Рождены править, обречены на жестокость",
                                "За герцога, перебей их всех",
                                "Во имя его пусть никто не устоит",
                                "Герцог защищает яростью",
                                "Жёсткая любовь",
                                "Жёсткие рамки дают хорошую жизнь",
                                "Покой в его железной хватке",
                                "Проси его милости, люби его справедливость",
                                "Жертвы пастуха ради спасения стада",
                                "Крепись сердцем и забирай сердца"
                        ]
                }
        ],
        [
                {
			Traits = [
				this.Const.FactionTrait.NobleHouse,
				this.Const.FactionTrait.Schemer,
				this.Const.FactionTrait.Sheriff
			],
                        Description = "Дом %noblehousename% трудится в тени, чтобы защитить свои земли. У агентов %noblehousename% глаза в каждом тёмном углу и уши в каждой стене, и внутри, и вне их границ. Мир держится на их землях, потому что %noblehousename% всегда наблюдает.",
                        Mottos = [
                                "Глаза на всём",
                                "Безопасность через надзор",
                                "Полная осведомлённость",
                                "Донос на соседа — во имя его защиты",
                                "Всевидящие",
                                "Знание — безопасность",
                                "Тени охраняют",
                                "Болтливые губы топят корабли",
                                "Только по принципу нужды знать",
                                "Хранимые тайной",
                                "Великий план"
                        ]
                },
                {
                        Traits = [
                                this.Const.FactionTrait.NobleHouse,
                                this.Const.FactionTrait.Collector,
                                this.Const.FactionTrait.Tyrant
                        ],
                        Description = "Дом %noblehousename% известен ревниво охраняемой кладовой сокровищ. Шёпотом по землям ходят легенды о запасах %noblehousename%, и всё же им мало.",
                        Mottos = [
                                "По одному всего",
                                "В зверинец",
                                "Для коллекции",
                                "Всему своё место",
                                "Место для каждой вещи",
                                "Всё идёт домой",
                                "Одно мне — и ещё одно мне",
                                "Мы собираем",
                                "Сокровищница Орды"
                        ]
                },
                {
                        Traits = [
				this.Const.FactionTrait.NobleHouse,
				this.Const.FactionTrait.ManOfThePeople,
				this.Const.FactionTrait.Schemer
			],
                        Description = "Дом %noblehousename% тонко направляет события ради высшего блага. Из своего дома в %factionfortressname% они выстраивают планы, чтобы принести благополучие простому люду. В жестоком мире они — слабый отблеск лучшего будущего.",
                        Mottos = [
                                "Планируй будущее",
                                "Воспитывай с дальновидностью",
                                "К более высокой цели",
                                "Строим планы вместе",
                                "Во благо всех",
                                "Звёзды сходятся в надежде",
                                "Видеть дальше боли",
                                "Светлое утро",
                                "Заложенный урожай",
                                "Семена сажаем ради детей",
                                "Строим завтрашний день"
                        ]
                },
                {
                        Traits = [
                                this.Const.FactionTrait.NobleHouse,
                                this.Const.FactionTrait.ManOfThePeople,
                                this.Const.FactionTrait.Marauder
                        ],
                        Description = "Славимый как кормилец своего народа, %noblehousename% добывает богатство набегами на врагов. Их капитаны и солдаты из крепости %factionfortressname% известны набегами на торговые караваны, дальние фермы и мелкие поселения. Они несут припасы домой, чтобы делиться добычей со своими людьми.",
                        Mottos = [
                                "Своих — прежде всего",
                                "Мы — избранные",
                                "Неверные падут",
                                "Ваше — наше",
                                "Всё ради нашего народа",
                                "Кровь за мой народ",
                                "Несём всё домой",
                                "Лучше мы, чем они",
                                "Наш люд — это всё"
                        ]
                },
        ],
        [
                {
			Traits = [
				this.Const.FactionTrait.NobleHouse,
				this.Const.FactionTrait.Schemer,
				this.Const.FactionTrait.Collector
			],
                        Description = "Торговля и торг могут быть столь же яростными, как война, и дом %noblehousename% — настоящий мастер хитрых сделок. Говорят, многие выгодные сделки %noblehousename% держатся не только на честной торговле, но и на взятках, вымогательстве и обмане. Семья живёт в пышной столице региона %factionfortressname%, но при несметных богатствах известна свирепой скупостью.",
                        Mottos = [
                                "Жить без тайных желаний",
                                "Смелым сопутствует удача",
                                "Мир недостаточен",
                                "Отделяй честных от полезных",
                                "Наш урожай тоже придёт",
                                "Зарабатываю, рискуя"
                        ]
                },
                {
			Traits = [
				this.Const.FactionTrait.NobleHouse,
				this.Const.FactionTrait.ManOfThePeople,
				this.Const.FactionTrait.Collector
			],
                        Description = "Дом %noblehousename% заявляет, что берёт начало во времена, когда люди впервые заявили права на эти земли и первый король правил всеми. Теперь они лишь один из многих родов, но гордятся длинной историей и мечтают продолжать её писать. Когда слава и ресурсы тают, говорят, что они финансируют экспедиции, пытаясь выкопать давно утраченные сокровища в затонувших городах и забытых местах.",
                        Mottos = [
                                "Дважды живёт тот, кто живёт хорошо",
                                "Богат тот, кто умеет им пользоваться",
                                "Запертое — в безопасности",
                                "Однажды и навсегда",
                                "Меряй и взвешивай",
                                "В безопасности на волнах",
                                "Каждому — своя доля",
                                "Под парусом и вёслами",
                                "Среди первых"
                        ]
                },
                {
                        Traits = [
                                this.Const.FactionTrait.NobleHouse,
                                this.Const.FactionTrait.Marauder,
                                this.Const.FactionTrait.Schemer
                        ],
                        Description = "Большинство членов дома %noblehousename% живут затворниками за толстыми дверями и решётчатыми окнами, и некоторых не видели годами. Ходят слухи, что их благородная кровь поражена безумием и помешательством, но простые люди не осмеливаются говорить об этом, опасаясь мести. Остальные дворянские дома избегают общения с %noblehousename%, ведь гостей там могут встретить и объятиями, и арбалетными болтами.",
                        Mottos = [
                                "Ничто в жизни не вечно",
                                "Помни о конце",
                                "Мы не презираем и не боимся",
                                "Не суди",
                                "Всё меняется",
                                "Каждый сам за себя",
                                "Всё нестабильно",
                                "Берегись волка"
                        ]
                }
        ]
]);


